paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/src/core/bearer_adv.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "bearer_adv.h"

#include <stddef.h>
#include <string.h>

#include "nrf_mesh_config_core.h"
#include "bearer.h"
#include "bearer_event.h"
#include "radio.h"
#include "timer_scheduler.h"
#include "packet.h"
#include "packet_mgr.h"
#include "fifo.h"
#include "rand.h"
#include "utils.h"
#include "toolchain.h"
#include "log.h"
#include "nrf_mesh_opt.h"
#include "event.h"
#include "bearer_event.h"

#include "nrf_mesh_assert.h"

#include "nrf_mesh_hw.h"
#include "ble_gap.h"

/*****************************************************************************
* Local defines
*****************************************************************************/
#define BLE_ADV_QUICK_START_OFFSET          (1000) /**< Earliest potential quick start time for a message */
#define BLE_ADV_CHANNEL_MAP_MASK            (0x07) /**< Channel map for advertisement channels. */
#define GAP_ADDR_SUM_MAX                    (0xFF * 5 + 0x3F) /**< Sum if all bits of random part is set in GAP address. */
/*****************************************************************************
* Local type definitions
*****************************************************************************/
/*****************************************************************************
* Static globals
*****************************************************************************/
/** Current scan channel */
static uint8_t m_scan_ch;
/** Scanning in progress */
static bool m_is_scanning = false;
/** Current configuration parameters */
static bearer_scan_config_t  m_scan_config;
/** Timer event for periodic scanning */
static timer_event_t m_scan_evt;
/** Timer event for periodic scan end */
static timer_event_t m_scan_window_end_evt;

/** Default Gap Address for Advertiser Init */
static ble_gap_addr_t m_default_gap_addr;

/*****************************************************************************
* Static functions
*****************************************************************************/
static void adv_evt_timeout(timestamp_t timestamp, void * p_context);

static void next_adv_schedule(advertiser_t* p_adv)
{
    timestamp_t time_now = timer_now();

    /* If there's less than adv_int ms since the last advertisement, schedule
     * for last advertisement + adv_int */
    if (TIMER_OLDER_THAN(p_adv->internal.adv_evt.timestamp, time_now) &&
        TIMER_OLDER_THAN(time_now, p_adv->internal.adv_evt.timestamp + p_adv->adv_int_min_ms * 1000))
    {
        uint32_t rand_offset = rand_prng_get(&p_adv->internal.adv_event_prng)
                % ((p_adv->adv_int_max_ms - p_adv->adv_int_min_ms) * 1000);
        timer_sch_reschedule(&p_adv->internal.adv_evt,
                p_adv->internal.adv_evt.timestamp + p_adv->adv_int_min_ms * 1000 + rand_offset);
    }
    else
    {
        /* Order timer with quick, randomized offset. */
        uint32_t rand_offset = rand_prng_get(&p_adv->internal.adv_event_prng)
            % (p_adv->adv_int_min_ms * 1000 - BLE_ADV_QUICK_START_OFFSET);
        timer_sch_reschedule(&p_adv->internal.adv_evt,
                time_now + BLE_ADV_QUICK_START_OFFSET + rand_offset);
    }

}

/** Order a preemptable scan for other mesh packets. Channel must be a valid BLE channel. */
static void scan_order(void)
{
    radio_event_t rx_evt;
    rx_evt.event_type = RADIO_EVENT_TYPE_RX_PREEMPTABLE;

    if (packet_mgr_alloc((void**) &rx_evt.p_packet, BLE_ADV_PACKET_MAX_LENGTH) != NRF_SUCCESS)
    {
        __LOG(LOG_SRC_BEARER, LOG_LEVEL_WARN, "scan_order(): cannot allocate memory for incoming packet\n");
        return;
    }

    rx_evt.channel = m_scan_ch;
    uint32_t count = 1;
    if (radio_order(&rx_evt, &count) == NRF_SUCCESS)
    {
        radio_invoke();
    }
    else
    {
        packet_mgr_decref(rx_evt.p_packet);
    }
}

static void scan_channel_iterate(void)
{
    while(true)
    {
        if(m_scan_ch == 39)
        {
            m_scan_ch = 36;
        }
        else
        {
            ++m_scan_ch;
        }

        if((1 << (m_scan_ch - 37)) & (m_scan_config.scan_channel_map))
        {
            break;
        }
    }
}

static void scan_begin_timer_cb(timestamp_t timestamp, void * p_context)
{
    m_is_scanning = true;
    scan_channel_iterate();
    scan_order();
}

static void scan_end_timer_cb(timestamp_t timestamp, void * p_context)
{
    m_is_scanning = false;
    radio_preemptable_cancel();
}

