paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/src/core/bearer_adv.c
static void packet_fields_set(packet_t* p_packet, advertiser_t* p_adv)
{
    p_packet->header._rfu1 = 0;
    p_packet->header._rfu2 = 0;
    p_packet->header._rfu3 = 0;
    p_packet->header.type = p_adv->adv_packet_type;
    p_packet->header.addr_type = p_adv->internal.ble_adv_addr.addr_type;
    memcpy(p_packet->addr, p_adv->internal.ble_adv_addr.addr, BLE_GAP_ADDR_LEN);
}

static void tx_event_send(void* p_context)
{
    /* done transmitting, no longer need the reference */
    nrf_mesh_evt_t tx_complete =
        {
            .type = NRF_MESH_EVT_TX_COMPLETE,
            .params.tx_complete.packet_id = (uint32_t) p_context
        };
    event_handle(&tx_complete);
}

static bool is_valid_gap_addr(const ble_gap_addr_t* p_addr)
{
    bool is_valid = false;
    switch (p_addr->addr_type)
    {
        case BLE_GAP_ADDR_TYPE_PUBLIC:
        case BLE_GAP_ADDR_TYPE_RANDOM_STATIC:
            /* The two most significant bits of the address shall be equal to 1 */
            if((p_addr->addr[5] & 0xC0) == 0xC0)
            {
                is_valid = true;
            }
            break;
        case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE:
            /* The two most significant bits of the address shall be equal to 0 */
            if((p_addr->addr[5] & 0xC0) == 0x00)
            {
                is_valid = true;
            }
            break;
        case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
            /* The two most significant bits of the address shall be equal to 0b10 */
            if((p_addr->addr[5] & 0xC0) == 0x80)
            {
                is_valid = true;
            }
            break;
        default:
            break;
    }

    /* All bits of the random part of the address shall not be equal to 1
       All bits of the random part of the address shall not be equal to 0 */
    uint32_t addr_sum = ((p_addr->addr[5] & 0x3F)
                         + p_addr->addr[4] + p_addr->addr[3] + p_addr->addr[2]
                         + p_addr->addr[1] + p_addr->addr[0]);
    if (!is_valid || (addr_sum == 0) || (addr_sum == GAP_ADDR_SUM_MAX))
    {
        return false;
    }
    else
    {
        return true;
    }
}

/*****************************************************************************
* Lower layer callback functions
*****************************************************************************/
/** Radio callback function for ending a reception event */
static void radio_rx_cb(uint8_t* p_data, bool success, uint32_t crc, int8_t rssi)
{
    if (!success)
    {
        packet_mgr_decref(p_data);
        return;
    }
    packet_t* p_packet = (packet_t*) p_data;

    packet_meta_t meta =
    {
        .rssi = rssi,
        .timestamp = timer_now(),
        .addr_type = p_packet->header.addr_type,
        .p_addr = p_packet->addr
    };

    m_scan_config.rx_cb(p_packet, BEARER_ADV_RADIO, &meta);
}

/** Radio callback function for ending a transmission event */
static void radio_tx_cb(uint8_t* p_data, bool free_packet)
{
    if (free_packet)
    {
        packet_mgr_decref((packet_t*) p_data);
        bearer_event_generic_post(tx_event_send, (void*) p_data);
    }
}

/** Radio callback function for reporting an empty radio event queue */
static void radio_idle_cb(void)
{
    if (m_is_scanning)
    {
        scan_order();
    }
}

static void packet_tx(packet_t* p_packet, uint8_t* p_channel_map, bool free_on_end)
{
    radio_event_t radio_evts[3];

    uint32_t count = 0;
    for (uint32_t ch = 0; ch < 3; ++ch)
    {
        if (*p_channel_map & (1 << ch))
        {
            radio_evts[count].event_type = RADIO_EVENT_TYPE_TX;
            radio_evts[count].p_packet = (uint8_t*) p_packet;
            radio_evts[count].free_on_end = free_on_end;
            radio_evts[count].channel = ch + 37;
            count++;
        }
    }

    radio_order(radio_evts, &count);
    radio_invoke();

    for (uint32_t ch = 0; ch < 3; ++ch)
    {
        if (*p_channel_map & (1 << ch))
        {
            if (count == 0)
            {
                *p_channel_map &= ~(1U << ch);
            }
            else
            {
                count--;
            }
        }
    }
}

/** Timer callback for advertisement event */
static void adv_evt_timeout(timestamp_t timestamp, void * p_context)
{
    advertiser_t* p_advertiser = (advertiser_t*) p_context;
    /* update state */
    p_advertiser->internal.advertisement_in_progress = false;
    const bool replace_infinite_beacon =
        (
             p_advertiser->internal.tx_evt.transmits == BEARER_ADV_REPEAT_INFINITE
             &&
             !fifo_is_empty(&p_advertiser->internal.tx_fifo)
        );


    /* fetch new packet */
    if (p_advertiser->internal.tx_evt.transmits == 0 || replace_infinite_beacon)
    {
        /* Replace the old packet - remove its reference. */
        if (p_advertiser->internal.tx_evt.p_packet != NULL)
        {
            packet_mgr_decref(p_advertiser->internal.tx_evt.p_packet);
            p_advertiser->internal.tx_evt.p_packet = NULL;
        }
        uint32_t error_code = fifo_pop(&p_advertiser->internal.tx_fifo, &p_advertiser->internal.tx_evt);

        if (error_code != NRF_SUCCESS)
        {
            /* no more events in fifo, stop advertising */
            return;
        }
        /* set BLE fields */
        packet_fields_set(p_advertiser->internal.tx_evt.p_packet, p_advertiser);
    }


    NRF_MESH_ASSERT(p_advertiser->adv_channel_map != 0);

    uint8_t ch_map = p_advertiser->adv_channel_map;
    const bool free_on_end = (p_advertiser->internal.tx_evt.transmits == 1);

    packet_tx(p_advertiser->internal.tx_evt.p_packet, &ch_map, free_on_end);

    if (ch_map != 0 && p_advertiser->internal.tx_evt.transmits != BEARER_ADV_REPEAT_INFINITE)
    {
        p_advertiser->internal.tx_evt.transmits--;
        if (free_on_end)
        {
            /* The packet will be freed in the radio TX callback. */
            p_advertiser->internal.tx_evt.p_packet = NULL;
        }
    }

    /* schedule next adv event */
    if (p_advertiser->internal.tx_evt.transmits > 0 || !fifo_is_empty(&p_advertiser->internal.tx_fifo))
    {
        p_advertiser->internal.advertisement_in_progress = true;

        /* Schedule next event according to regular advertisement intervals. */
        uint32_t rand_offset = 0;

        if (p_advertiser->adv_int_max_ms > p_advertiser->adv_int_min_ms)
        {
            rand_offset = rand_prng_get(&p_advertiser->internal.adv_event_prng)
                % ((p_advertiser->adv_int_max_ms - p_advertiser->adv_int_min_ms) * 1000);
        }

        /* Set the interval, will make the timer event jump back into the queue with the given offset. */
        p_advertiser->internal.adv_evt.interval = p_advertiser->adv_int_min_ms * 1000 + rand_offset;
    }
    else if (fifo_is_empty(&p_advertiser->internal.tx_fifo))
    {
        /* Won't automatically go back into the queue if interval is 0: */
        p_advertiser->internal.adv_evt.interval = 0;

