paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/src/core/bearer_adv.c
        if (p_advertiser->queue_empty_cb != NULL)
        {
            p_advertiser->queue_empty_cb(p_advertiser);
        }
    }
}
/*****************************************************************************
* Interface functions
*****************************************************************************/

uint32_t bearer_adv_init(bearer_scan_config_t* p_config)
{
    uint32_t error_code = bearer_adv_reconfig(p_config);
    if (error_code != NRF_SUCCESS)
    {
        return error_code;
    }

    m_scan_ch = 36;
    m_is_scanning = false;

    memset(&m_scan_window_end_evt, 0, sizeof(timer_event_t));
    memset(&m_scan_evt, 0, sizeof(timer_event_t));

    radio_init_params_t radio_params =
        {
            .radio_mode     = RADIO_MODE_MODE_Ble_1Mbit,
            .access_address = BEARER_ADV_ACCESS_ADDR,
            .rx_cb          = radio_rx_cb,
            .tx_cb          = radio_tx_cb,
            .idle_cb        = radio_idle_cb
        };
    __LOG(LOG_SRC_BEARER, LOG_LEVEL_DBG1, "BEARER_ADV_ACCESS_ADDR: %8X\n", BEARER_ADV_ACCESS_ADDR);
    radio_init(&radio_params);

    if (!is_valid_gap_addr(&m_default_gap_addr))
    {
        ble_gap_addr_t ficr_gap_addr;
        error_code = bearer_adv_addr_get(&ficr_gap_addr);
        if (error_code != NRF_SUCCESS)
        {
            return error_code;
        }
        bearer_adv_gap_type_set(&ficr_gap_addr);
        bearer_adv_addr_default_set(&ficr_gap_addr);
    }

    return NRF_SUCCESS;
}

uint32_t bearer_adv_advertiser_init(advertiser_t* p_adv)
{
    if (p_adv == NULL)
    {
        return NRF_ERROR_NULL;
    }

    p_adv->internal.tx_fifo.elem_size = sizeof(tx_packet_t);
    p_adv->internal.tx_fifo.elem_array = p_adv->internal.tx_fifo_buffer;
    p_adv->internal.tx_fifo.array_len = BEARER_TX_QUEUE_LENGTH;
    fifo_init(&p_adv->internal.tx_fifo);

    rand_prng_seed(&p_adv->internal.adv_event_prng);

    p_adv->internal.tx_evt.p_packet = NULL;
    p_adv->internal.tx_evt.transmits = 0;
    p_adv->internal.advertisement_in_progress = false;
    memset(&p_adv->internal.adv_evt, 0, sizeof(timer_event_t));

    p_adv->internal.adv_evt.cb = adv_evt_timeout;
    p_adv->internal.adv_evt.p_context = p_adv;

    memcpy(&p_adv->internal.ble_adv_addr.addr[0], &m_default_gap_addr.addr[0], BLE_GAP_ADDR_LEN);
    p_adv->internal.ble_adv_addr.addr_type = m_default_gap_addr.addr_type;

    __LOG(LOG_SRC_BEARER, LOG_LEVEL_INFO, "Advertiser address: %.02x:%.02x:%.02x:%.02x:%.02x:%.02x\n",
        p_adv->internal.ble_adv_addr.addr[5], p_adv->internal.ble_adv_addr.addr[4], p_adv->internal.ble_adv_addr.addr[3],
        p_adv->internal.ble_adv_addr.addr[2], p_adv->internal.ble_adv_addr.addr[1], p_adv->internal.ble_adv_addr.addr[0]);

    return NRF_SUCCESS;
}

uint32_t bearer_adv_opt_set(nrf_mesh_opt_id_t id, const nrf_mesh_opt_t * const p_opt)
{
    switch (id)
    {
        case NRF_MESH_OPT_RADIO_MODE:
            radio_mode_set((uint8_t) p_opt->opt.radio_mode);
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_ACCESS_ADDR:
            radio_access_addr_set(p_opt->opt.val);
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_CHMAP:
            if (p_opt->opt.chmap.adv_chmap != 0x00 &&
                p_opt->opt.chmap.adv_chmap <= 0x07)
            {
                m_scan_config.scan_channel_map = p_opt->opt.chmap.adv_chmap;
                return NRF_SUCCESS;
            }
            else
            {
                return NRF_ERROR_INVALID_PARAM;
            }

        case NRF_MESH_OPT_RADIO_SCAN_INT_MS:
            if ((p_opt->opt.val < BEARER_ADV_SCAN_INT_MIN) ||
                (p_opt->opt.val > BEARER_ADV_SCAN_INT_MAX))
            {
                return NRF_ERROR_INVALID_PARAM;
            }
            m_scan_config.scan_int_ms = p_opt->opt.val;
            bearer_adv_scan_start();
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_SCAN_WINDOW_MS:
            if ((p_opt->opt.val < BEARER_ADV_SCAN_INT_MIN) ||
                (p_opt->opt.val > m_scan_config.scan_int_ms))
            {
                return NRF_ERROR_INVALID_PARAM;
            }
            m_scan_config.scan_window_ms = p_opt->opt.val;
            bearer_adv_scan_start();
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_TX_POWER:
            radio_tx_power_set((radio_tx_power_t) p_opt->opt.val);
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_AD_TYPE_FILTERING:
            bearer_adtype_filtering_set( (bool) p_opt->opt.val);
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_AD_TYPE_ADD:
            bearer_adtype_add((uint8_t) p_opt->opt.val);
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_AD_TYPE_REMOVE:
            bearer_adtype_remove((uint8_t) p_opt->opt.val);
            return NRF_SUCCESS;

        default:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_ERROR, "Unknown option %d...", id); /* TODO: Assertable? */
            return NRF_ERROR_INVALID_PARAM;
    }
}

uint32_t bearer_adv_reconfig(bearer_scan_config_t* p_config)
{
    if (p_config == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if ((p_config->scan_channel_map & ~BLE_ADV_CHANNEL_MAP_MASK) ||
        (p_config->scan_channel_map == 0) ||
        (p_config->scan_int_ms < BEARER_ADV_SCAN_INT_MIN) ||
        (p_config->scan_int_ms > BEARER_ADV_SCAN_INT_MAX) ||
        (p_config->scan_window_ms < BEARER_ADV_SCAN_INT_MIN) ||
        (p_config->scan_window_ms > BEARER_ADV_SCAN_INT_MAX) ||
        (p_config->scan_window_ms > p_config->scan_int_ms)
        )
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    memcpy(&m_scan_config, p_config, sizeof(bearer_scan_config_t));

    return NRF_SUCCESS;
}

uint32_t bearer_adv_opt_get(nrf_mesh_opt_id_t id, nrf_mesh_opt_t * const p_opt)
{
    switch (id)
    {
        case NRF_MESH_OPT_RADIO_MODE:
            p_opt->opt.radio_mode = (nrf_mesh_radio_mode_t) radio_mode_get();
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_ACCESS_ADDR:
            p_opt->opt.val = radio_access_addr_get();
            return NRF_SUCCESS;

