paladinzh/BLE_Mesh/NRF_MESH/nRF5_SDK_for_Mesh/mesh/src/core/bearer_adv.c
        case NRF_MESH_OPT_RADIO_CHMAP:
            p_opt->opt.chmap.adv_chmap = m_scan_config.scan_channel_map & 0x07;
            p_opt->opt.chmap.ext_chmap = 0;
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_SCAN_INT_MS:
            p_opt->opt.val = m_scan_config.scan_int_ms;
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_SCAN_WINDOW_MS:
            p_opt->opt.val = m_scan_config.scan_window_ms;
            return NRF_SUCCESS;

        case NRF_MESH_OPT_RADIO_TX_POWER:
            p_opt->opt.val = radio_tx_power_get();
            return NRF_SUCCESS;

        default:
            __LOG(LOG_SRC_BEARER, LOG_LEVEL_ERROR, "Unknown option %d...", id); /* TODO: Assertable? */
            return NRF_ERROR_INVALID_PARAM;
    }
}


bool bearer_adv_available(advertiser_t* p_adv)
{
    return !fifo_is_full(&p_adv->internal.tx_fifo);
}

uint32_t bearer_adv_tx(advertiser_t* p_adv, packet_t* p_packet, uint8_t transmits)
{
    uint32_t error_code;
    tx_packet_t tx_evt;
    tx_evt.p_packet = p_packet;
    tx_evt.transmits = transmits;

    NRF_MESH_ASSERT(p_packet->header.length <= 37);

    error_code = fifo_push(&p_adv->internal.tx_fifo, &tx_evt);
    if (error_code == NRF_SUCCESS && !p_adv->internal.advertisement_in_progress)
    {
        p_adv->internal.advertisement_in_progress = true;
        next_adv_schedule(p_adv);
    }

    return (error_code == NRF_ERROR_NO_MEM) ? NRF_ERROR_BUSY : error_code ;
}

uint32_t bearer_adv_tx_raw(packet_t* p_packet, uint8_t* p_channel_map)
{
    if (p_packet == NULL || p_channel_map == NULL)
    {
        return NRF_ERROR_NULL;
    }
    if ((*p_channel_map & BLE_ADV_CHANNEL_MAP_MASK) == 0)
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    /* Transmit on all channels */
    packet_tx(p_packet, p_channel_map, true);
    if (*p_channel_map == 0)
    {
        return NRF_ERROR_NO_MEM;
    }
    else
    {
        return NRF_SUCCESS;
    }
}

uint32_t bearer_adv_adv_stop(advertiser_t* p_adv)
{
    if (p_adv->internal.advertisement_in_progress)
    {
        timer_sch_abort(&p_adv->internal.adv_evt);
        return NRF_SUCCESS;
    }

    return NRF_ERROR_INVALID_STATE;
}

void bearer_adv_adv_start(advertiser_t* p_adv)
{
    if (!p_adv->internal.advertisement_in_progress && !fifo_is_empty(&p_adv->internal.tx_fifo))
    {
        p_adv->internal.advertisement_in_progress = true;
        next_adv_schedule(p_adv);
    }
}

void bearer_adv_flush_tx(advertiser_t* p_adv)
{
    (void) bearer_adv_adv_stop(p_adv);

    /* Prevent advertisement timer from triggering while we flush */
    bearer_event_critical_section_begin();

    p_adv->internal.advertisement_in_progress = false;

    /* If remaining transmits is 0, the tx event packet either isn't present, or
     * it's in the process of being transmitted. Either way, we shouldn't
     * decref it here. */
    if (p_adv->internal.tx_evt.p_packet && p_adv->internal.tx_evt.transmits > 0)
    {
        packet_t* p_packet = p_adv->internal.tx_evt.p_packet;
        p_adv->internal.tx_evt.p_packet = NULL;
        packet_mgr_decref(p_packet);
        p_adv->internal.tx_evt.transmits = 0;
    }
    tx_packet_t tx_packet;
    while (fifo_pop(&p_adv->internal.tx_fifo, &tx_packet) == NRF_SUCCESS)
    {
        packet_mgr_decref(tx_packet.p_packet);
    }
    bearer_event_critical_section_end();
}

void bearer_adv_interval_reset(advertiser_t * p_adv)
{
    p_adv->internal.advertisement_in_progress = true;
    timer_sch_reschedule(&p_adv->internal.adv_evt, timer_now() + p_adv->adv_int_min_ms * 1000);
}

void bearer_adv_scan_start(void)
{
    m_is_scanning = false;
    timestamp_t start_time = timer_now() + 1000;
    m_scan_evt.interval = 1000 * m_scan_config.scan_int_ms;
    m_scan_evt.cb = scan_begin_timer_cb;
    timer_sch_reschedule(&m_scan_evt, start_time);

    if (m_scan_config.scan_int_ms != m_scan_config.scan_window_ms)
    {
        m_scan_window_end_evt.interval = 1000 * m_scan_config.scan_int_ms;
        m_scan_window_end_evt.cb = scan_end_timer_cb;
        timer_sch_reschedule(&m_scan_window_end_evt, start_time + m_scan_config.scan_window_ms * 1000);
    }
}

void bearer_adv_scan_stop(void)
{
    timer_sch_abort(&m_scan_evt);
    timer_sch_abort(&m_scan_window_end_evt);
    scan_end_timer_cb(0, NULL);
}

uint32_t bearer_adv_addr_get(ble_gap_addr_t* p_addr)
{
#if !defined(HOST)
    p_addr->addr_type = !!(NRF_FICR->DEVICEADDRTYPE);
    memcpy(p_addr->addr, (uint8_t*) NRF_FICR->DEVICEADDR, BLE_GAP_ADDR_LEN);
    return bearer_adv_gap_type_set(p_addr);
#else
    return NRF_SUCCESS;
#endif
}

uint32_t bearer_adv_gap_type_set(ble_gap_addr_t* p_addr)
{
    if (!p_addr)
    {
        return NRF_ERROR_NULL;
    }

    switch (p_addr->addr_type)
    {
        case BLE_GAP_ADDR_TYPE_PUBLIC:
        case BLE_GAP_ADDR_TYPE_RANDOM_STATIC:
            /* The two most significant bits of the address shall be equal to 1 */
            p_addr->addr[5] = 0xC0 | p_addr->addr[5];
            break;
        case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE:
            /* The two most significant bits of the address shall be equal to 0 */
            p_addr->addr[5] = 0x3F & p_addr->addr[5];
            break;
        case BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE:
            /* The two most significant bits of the address shall be equal to 0b10 */
            p_addr->addr[5] = 0xBF & p_addr->addr[5];
            p_addr->addr[5] = 0x40 | p_addr->addr[5];
            break;
        default:
            return NRF_ERROR_INVALID_PARAM;
    }
    return NRF_SUCCESS;
}

uint32_t bearer_adv_addr_default_set(const ble_gap_addr_t* p_addr)
{
    if (!p_addr)
    {
        return NRF_ERROR_NULL;
    }
    else if (!is_valid_gap_addr(p_addr))
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    else
    {
        memcpy(m_default_gap_addr.addr, p_addr->addr, BLE_GAP_ADDR_LEN);
        m_default_gap_addr.addr_type = p_addr->addr_type;
        return NRF_SUCCESS;
    }
}

uint32_t bearer_adv_addr_set(advertiser_t* p_adv, const ble_gap_addr_t* p_addr)
{
    if (!p_adv || !p_addr)
    {
        return NRF_ERROR_NULL;
    }
    else if (!is_valid_gap_addr(p_addr))
    {
        return NRF_ERROR_INVALID_ADDR;
    }
    else
    {
        memcpy(p_adv->internal.ble_adv_addr.addr, p_addr->addr, BLE_GAP_ADDR_LEN);
        p_adv->internal.ble_adv_addr.addr_type = p_addr->addr_type;
        return NRF_SUCCESS;
    }
}

